1)int类型占用的存储空间4字节，数值范围-2147483648~2147483647
2)x&=x-1，去掉最右的1个1，f函数的功能是统计参数x二进制值中包含的1的个数
3)x&-x，返回的是x二进制最后一位的整数值，
	如x=52=>...00110100,-x=-52=>...11001100
	00110100
	11001100 &
	----------
	00000100 => 4 
4)补码，在C/C++中数值的二进制用补码表示
	（1）整数的补码就是整数的原码
	（2）负数的补码是原码取反后再加一
	（3）负数的最高位用二进制1补充
	如-52的补码：
		1）取52的原码 0000 0000 0000 0000 0000 0000 0011 0100
		2）取52的反码 1111 1111 1111 1111 1111 1111 1100 1011
		3）算-52的补码                                      1 +
		4）-52的补码是1111 1111 1111 1111 1111 1111 1100 1100 
		
竞赛或者重要的考试，不会轻易的让你舒服
18. 5 个数 
2->0010 => f(2)=1 + g(2)=2 > 3
11->1011 => f(11))=3 + g(11)=1 >4 
9->1001   =>f(9)=2 + g(9)=1 >3
16->10000 =>f(16)=1 + g(16) =16 >17
10->1010 =>f(10)=2  + g(10) = 2 >4 

19.
511998->1111100111111111110=>f(511998)=16+g(511998)
 > 18
 
函数需要先声明后使用
1. 直接将函数体写在调用之前
2. 先声明函数名在调佣之前，可以在调用之后实现声明的函数体   
  例如：
   int g(ing x);
   int main(){
   	 cout << f(a[i]) + g(a[i]) << endl;
   }    
   int g(int x){
   	return x & -x;
   }
   
21.B
   
2个数，分别是-65536和2147483647
a=-65536的补码1111 1111 1111 1111 0000 0000 0000 0000
b=2147483647补码0111 1111 1111 1111 1111 1111 1111 1111
f(a)=16+g(a)=65536 = 65552
f(b)=31+g(b)=1 =>32

阅读程序题的答题方法
1）根据常识直接判断，如果程序读不懂也可以做 

 
 
 阅读程序的第2题
 10行，base[0] ~base[25] 填充 'A'~'Z'
 11行，base[26]~base[51] 填充 'a'~'z'
 12行，base[52]~base[61] 填充 '0'~'9'
 base[62]='+',base[63]='/'
 {'A',,'Z','a',,'z','0',,'9','+','/'}
   0    25  26   51  52   61  62  63
十六进制0xff = 二进制11111111 = 十进制-1
15行，table={-1,,-1}
             0   255
A    Z  a   z     0   9  +   /
65   90 97  122   48  57 43  47

16行，
table['A']=table[65]=0
table['Z']=table[90]=25
table['a']=table[97]=26
table['z']=table[122]=51
table['0']=table[48]=52
table['9']=table[57] =61
table['+']=table[43]= 62
table['/']=table[47]=63
table['=']=0
table[0~40]=-1,table[123~255]=-1

a0==,a1==
a0==
decode("a0==")
  ret += table[str[i]] = table[str[0]]=table[a]<<2 | table[str[i+1]]=table['0']=52>>4
a,table[a]=26 = 0001 1010 << 2 = 0110 1000
0     table[0]=52 = 0011 1000 >> 4 = 0000 0011 |
=     -----------------------------------------
=                                    0110 1011 = 64+32+8+2+1= 107 = k
a,table[a]=26 = 0001 1010 << 2 = 0110 1000
1	 table[1]=53 = 0011 1001 >> 4 = 0000 0011 |
=	               ----------------------------
=	                                0110 1011 = k

Y2Nm=3个字符
IDIW=3个字符
MjE=>2个字符 

如果N=20，请问1~20中素数有哪些
           0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20
b 标记数组[    0,0,1,0 1,0,1,1,1 ,0 ,1 ,0 ,1 ,1 ,1, 0 ,1 ,0,  1]
c 质数数组[2,3,5,7,11,13,17,19
                                 ] 
f 数N约数个数[] 
g 约数的和 

0000 0000
0000 0001
0000 0001
0000 0001
0000 0000










